routes_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # render plain: 'Dave and veras first rails request'
        @users = User.all