art_share/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "sun"], ["image_url", "flower.com"], ["updated_at", "2022-05-05 15:57:01.304991"], ["id", 7]]
---
    def update
        artwork = Artwork.find(params[:id])

        if artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 7]]
---
    def destroy
        debugger
        artwork = Artwork.find(params[:id])

        if artwork.destroy