art_share/app/controllers/artwork_shares_controller.rb

    def index
        @artwork_shares = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

    def destroy
        debugger
        artwork_share = ArtworkShare.find(params[:id])

        if artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 4]]