art_share/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # render plain: 'Dave and veras first rails request'
        @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "john"], ["updated_at", "2022-05-05 15:35:10.125814"], ["id", 1]]
---
    def update
        user = User.find(params[:id])
        if user.update(params.require(:user).permit(:name, :email))